'''
获取一维数组的数据:
    ndarray[x ,y]

获取二维数组的数据:
    二维数组[行索引开始:行索引结束:步长, 列索引开始:列索引结束:步长]，含头不含尾

获取三维数组的数据:
    可以通过 `[depth, row, column]` 进行索引和切片，提取特定的层、行、列或子阵列。


'''

import numpy as np

arr_1 = np.array([[1, 2, 3], [4, 5, 6]])

# 获取一维
print(arr_1[0, 1])
print(arr_1[1, 1])


#获取二维
arr_2 = np.array(
    [
        [10, 2, 3, 73, 8, 7, 6],
        [11, 5, 6, 74, 8, 9, 10],
        [22, 5, 6, 75, 8, 9, 10],
        [33, 5, 6, 76, 8, 9, 10],
        [44, 5, 6, 77, 8, 9, 10],
        [55, 5, 6, 78, 8, 9, 10],
        [66, 5, 6, 79, 8, 9, 10],
    ]
)
#获取从第二行开始到末尾，步长为2的行，并且 从第3行开始到末尾，步长为2的列的数据
print(arr_2[1::2, 2::2])


# 获取三维数据
arr_3 = np.array([[[1,2,3],[4,5,6]], [[12,3,34],[5,6,7]]])

# [Deep, Row, Col]
#第一个，第一行，第二个数据
print(arr_3[0, 0, 1])


